In [1]:
import pandas as pd
import numpy as np

In [4]:
#Create DataFrame from 1 D array
df=pd.DataFrame({'mycolumn':np.arange(1,11)})
df.tail()

   mycolumn
5         6
6         7
7         8
8         9
9        10

In [3]:
data=pd.read_csv(r"C:\Users\Tnluser\Documents\Scalar\mckinsey.csv")
data.head()

       country  year  population continent  life_exp     gdp_cap
0  Afghanistan  1952     8425333      Asia    28.801  779.445314
1  Afghanistan  1957     9240934      Asia    30.332  820.853030
2  Afghanistan  1962    10267083      Asia    31.997  853.100710
3  Afghanistan  1967    11537966      Asia    34.020  836.197138
4  Afghanistan  1972    13079460      Asia    36.088  739.981106

In [7]:
# Unique countries with number of entries for each country
data.country.value_counts().head()

Afghanistan    12
Pakistan       12
New Zealand    12
Nicaragua      12
Niger          12
Name: country, dtype: int64

In [12]:
#function of series to find the unique values in the column
data['country'].unique()

array(['Afghanistan', 'Albania', 'Algeria', 'Angola', 'Argentina',
       'Australia', 'Austria', 'Bahrain', 'Bangladesh', 'Belgium',
       'Benin', 'Bolivia', 'Bosnia and Herzegovina', 'Botswana', 'Brazil',
       'Bulgaria', 'Burkina Faso', 'Burundi', 'Cambodia', 'Cameroon',
       'Canada', 'Central African Republic', 'Chad', 'Chile', 'China',
       'Colombia', 'Comoros', 'Congo, Dem. Rep.', 'Congo, Rep.',
       'Costa Rica', "Cote d'Ivoire", 'Croatia', 'Cuba', 'Czech Republic',
       'Denmark', 'Djibouti', 'Dominican Republic', 'Ecuador', 'Egypt',
       'El Salvador', 'Equatorial Guinea', 'Eritrea', 'Ethiopia',
       'Finland', 'France', 'Gabon', 'Gambia', 'Germany', 'Ghana',
       'Greece', 'Guatemala', 'Guinea', 'Guinea-Bissau', 'Haiti',
       'Honduras', 'Hong Kong, China', 'Hungary', 'Iceland', 'India',
       'Indonesia', 'Iran', 'Iraq', 'Ireland', 'Israel', 'Italy',
       'Jamaica', 'Japan', 'Jordan', 'Kenya', 'Korea, Dem. Rep.',
       'Korea, Rep.', 'Kuwait', 'Lebanon', 'Lesotho', 'Liberia', 'Libya',
       'Madagascar', 'Malawi', 'Malaysia', 'Mali', 'Mauritania',
       'Mauritius', 'Mexico', 'Mongolia', 'Montenegro', 'Morocco',
       'Mozambique', 'Myanmar', 'Namibia', 'Nepal', 'Netherlands',
       'New Zealand', 'Nicaragua', 'Niger', 'Nigeria', 'Norway', 'Oman',
       'Pakistan', 'Panama', 'Paraguay', 'Peru', 'Philippines', 'Poland',
       'Portugal', 'Puerto Rico', 'Reunion', 'Romania', 'Rwanda',
       'Sao Tome and Principe', 'Saudi Arabia', 'Senegal', 'Serbia',
       'Sierra Leone', 'Singapore', 'Slovak Republic', 'Slovenia',
       'Somalia', 'South Africa', 'Spain', 'Sri Lanka', 'Sudan',
       'Swaziland', 'Sweden', 'Switzerland', 'Syria', 'Taiwan',
       'Tanzania', 'Thailand', 'Togo', 'Trinidad and Tobago', 'Tunisia',
       'Turkey', 'Uganda', 'United Kingdom', 'United States', 'Uruguay',
       'Venezuela', 'Vietnam', 'West Bank and Gaza', 'Yemen, Rep.',
       'Zambia', 'Zimbabwe'], dtype=object)

In [13]:
#output is number of unique counties
data['country'].nunique()

142

In [14]:
data.continent.unique()

array(['Asia', 'Europe', 'Africa', 'Americas', 'Oceania'], dtype=object)

In [15]:
data.continent.nunique()

5

In [16]:
#how many rows/ freuency belongs to each continent in this dataframe
data.continent.value_counts()

Africa      624
Asia        396
Europe      360
Americas    300
Oceania      24
Name: continent, dtype: int64

In [19]:
#what percentage of rows belong to each continent 
round((data.continent.value_counts()/data.shape[0])*100,2)

Africa      36.62
Asia        23.24
Europe      21.13
Americas    17.61
Oceania      1.41
Name: continent, dtype: float64

In [20]:
#method2
data.continent.value_counts(normalize=True)

Africa      0.366197
Asia        0.232394
Europe      0.211268
Americas    0.176056
Oceania     0.014085
Name: continent, dtype: float64

In [22]:
#insert new column in the dataFrame

data['dummy']=np.arange(data.shape[0])
data.head()
# other method to insert data of string datatype
data['dummy2']=np.array(np.arange(data.shape[0]),dtype=str)

In [31]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   country     1704 non-null   object
 1   year        1704 non-null   int64
 2   population  1704 non-null   int64
 3   continent   1704 non-null   object
 4   life_exp    1704 non-null   float64
 5   gdp_cap     1704 non-null   float64
 6   dummy       1704 non-null   int32
 7   dummy2      1704 non-null   object
dtypes: float64(2), int32(1), int64(2), object(3)
memory usage: 100.0+ KB

In [33]:
data['year+7']=data.year+7
data.head()

,country,year,population,continent,life_exp,gdp_cap,dummy,dummy2,year+7
0,Afghanistan,1952,8425333,Asia,28.801,779.445314,0,0,1959
1,Afghanistan,1957,9240934,Asia,30.332,820.853030,1,1,1964
2,Afghanistan,1962,10267083,Asia,31.997,853.100710,2,2,1969
3,Afghanistan,1967,11537966,Asia,34.020,836.197138,3,3,1974
4,Afghanistan,1972,13079460,Asia,36.088,739.981106,4,4,1979

In [37]:
data['year_sqrt']=round(data.year.apply(np.sqrt),2)
data.head()

,country,year,population,continent,life_exp,gdp_cap,dummy,dummy2,year+7,year_sqrt
0,Afghanistan,1952,8425333,Asia,28.801,779.445314,0,0,1959,44.18
1,Afghanistan,1957,9240934,Asia,30.332,820.853030,1,1,1964,44.24
2,Afghanistan,1962,10267083,Asia,31.997,853.100710,2,2,1969,44.29
3,Afghanistan,1967,11537966,Asia,34.020,836.197138,3,3,1974,44.35
4,Afghanistan,1972,13079460,Asia,36.088,739.981106,4,4,1979,44.41

In [40]:
data.drop(['dummy','dummy2'],axis=1,inplace=True)

In [41]:
data.head()

,country,year,population,continent,life_exp,gdp_cap,year+7,year_sqrt
0,Afghanistan,1952,8425333,Asia,28.801,779.445314,1959,44.18
1,Afghanistan,1957,9240934,Asia,30.332,820.853030,1964,44.24
2,Afghanistan,1962,10267083,Asia,31.997,853.100710,1969,44.29
3,Afghanistan,1967,11537966,Asia,34.020,836.197138,1974,44.35
4,Afghanistan,1972,13079460,Asia,36.088,739.981106,1979,44.41

In [42]:
data['year_mul']=data.year.apply(lambda x: x*2)
data.head()

,country,year,population,continent,life_exp,gdp_cap,year+7,year_sqrt,year_mul
0,Afghanistan,1952,8425333,Asia,28.801,779.445314,1959,44.18,3904
1,Afghanistan,1957,9240934,Asia,30.332,820.853030,1964,44.24,3914
2,Afghanistan,1962,10267083,Asia,31.997,853.100710,1969,44.29,3924
3,Afghanistan,1967,11537966,Asia,34.020,836.197138,1974,44.35,3934
4,Afghanistan,1972,13079460,Asia,36.088,739.981106,1979,44.41,3944

In [50]:
data.shape

(1704, 9)

In [55]:
ls=np.arange(9)

In [53]:
data.columns

Index(['country', 'year', 'population', 'continent', 'life_exp', 'gdp_cap',
       'year+7', 'year_sqrt', 'year_mul'],
      dtype='object')

In [45]:
##sort_value
data.sort_values(by=['year','country'],na_position='first')

,country,year,population,continent,life_exp,gdp_cap,year+7,year_sqrt,year_mul
0,Afghanistan,1952,8425333,Asia,28.801,779.445314,1959,44.18,3904
12,Albania,1952,1282697,Europe,55.230,1601.056136,1959,44.18,3904
24,Algeria,1952,9279525,Africa,43.077,2449.008185,1959,44.18,3904
36,Angola,1952,4232095,Africa,30.015,3520.610273,1959,44.18,3904
48,Argentina,1952,17876956,Americas,62.485,5911.315053,1959,44.18,3904
...,...,...,...,...,...,...,...,...,...
1655,Vietnam,2007,85262356,Asia,74.249,2441.576404,2014,44.80,4014
1667,West Bank and Gaza,2007,4018332,Asia,73.422,3025.349798,2014,44.80,4014
1679,"Yemen, Rep.",2007,22211743,Asia,62.698,2280.769906,2014,44.80,4014
1691,Zambia,2007,11746035,Africa,42.384,1271.211593,2014,44.80,4014
1703,Zimbabwe,2007,12311143,Africa,43.487,469.709298,2014,44.80,4014

In [44]:
data.head()

,country,year,population,continent,life_exp,gdp_cap,year+7,year_sqrt,year_mul
0,Afghanistan,1952,8425333,Asia,28.801,779.445314,1959,44.18,3904
1,Afghanistan,1957,9240934,Asia,30.332,820.853030,1964,44.24,3914
2,Afghanistan,1962,10267083,Asia,31.997,853.100710,1969,44.29,3924
3,Afghanistan,1967,11537966,Asia,34.020,836.197138,1974,44.35,3934
4,Afghanistan,1972,13079460,Asia,36.088,739.981106,1979,44.41,3944

In [100]:
data['implicit index']=data.index
data.head()

,country,year,population,continent,life_exp,gdp_cap,year+7,year_sqrt,year_mul,implicit index
0,Afghanistan,1952,8425333,Asia,28.801,779.445314,1959,44.18,3904,0
1,Afghanistan,1957,9240934,Asia,30.332,820.853030,1964,44.24,3914,1
2,Afghanistan,1962,10267083,Asia,31.997,853.100710,1969,44.29,3924,2
3,Afghanistan,1967,11537966,Asia,34.020,836.197138,1974,44.35,3934,3
4,Afghanistan,1972,13079460,Asia,36.088,739.981106,1979,44.41,3944,4

In [101]:
data.index=np.arange(2,len(data.index)+2)
data.head()

,country,year,population,continent,life_exp,gdp_cap,year+7,year_sqrt,year_mul,implicit index
2,Afghanistan,1952,8425333,Asia,28.801,779.445314,1959,44.18,3904,0
3,Afghanistan,1957,9240934,Asia,30.332,820.853030,1964,44.24,3914,1
4,Afghanistan,1962,10267083,Asia,31.997,853.100710,1969,44.29,3924,2
5,Afghanistan,1967,11537966,Asia,34.020,836.197138,1974,44.35,3934,3
6,Afghanistan,1972,13079460,Asia,36.088,739.981106,1979,44.41,3944,4

In [105]:
#implicit index is used by iloc
data.iloc[2:4] #2, 3

,country,year,population,continent,life_exp,gdp_cap,year+7,year_sqrt,year_mul,implicit index
4,Afghanistan,1962,10267083,Asia,31.997,853.100710,1969,44.29,3924,2
5,Afghanistan,1967,11537966,Asia,34.020,836.197138,1974,44.35,3934,3

In [109]:
data.iloc[2:4][['country','year']]

       country  year
4  Afghanistan  1962
5  Afghanistan  1967

In [104]:
data.loc[2:4] # fetch from explicit indices 2,3,4

,country,year,population,continent,life_exp,gdp_cap,year+7,year_sqrt,year_mul,implicit index
2,Afghanistan,1952,8425333,Asia,28.801,779.445314,1959,44.18,3904,0
3,Afghanistan,1957,9240934,Asia,30.332,820.853030,1964,44.24,3914,1
4,Afghanistan,1962,10267083,Asia,31.997,853.100710,1969,44.29,3924,2

In [92]:
data[:2][['country','year']]

       country  year
0  Afghanistan  1952
1  Afghanistan  1957

In [93]:
s=pd.Series(np.arange(6),index=[1,2,3,4,5,6])
s

1    0
2    1
3    2
4    3
5    4
6    5
dtype: int32

In [97]:
arr=np.arange(6).reshape(2,3)
arr

array([[0, 1, 2],
       [3, 4, 5]])

In [99]:
arr[:,1:]

array([[1, 2],
       [4, 5]])

In [69]:
for i in range(len(data.columns)):
    print(data.columns[i]+":"+str(i))

country:0
year:1
population:2
continent:3
life_exp:4
gdp_cap:5
year+7:6
year_sqrt:7
year_mul:8

In [78]:
#implicit Indices are in use while slicing
s[0:4]

1    0
2    1
3    2
4    3
dtype: int32

In [79]:
#explicit index is in use while indexing
s[1]

0

In [77]:
s[0]

KeyError: 0